<?php

use Illuminate\Database\Seeder;
use Carbon\Carbon;
use App\Category;

class CategoriesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = $this->getCats();

        foreach($data as $key=>$arr){
            $id = $this->add($key);
            if(count($arr)) {
                foreach ($arr as $item) {
                    $this->add($item, $id);
                }
            }
        }

    }

    public function add($item, $parent=false)
    {
            Category::reguard();
            $category = Category::add(['slug' => $this->transliterate($item)]);
            $category->setProperties(['uk' => ['name' => $item], 'ru' => ['name' => $item]]);
            if($parent) $category->setParent($parent);
            return $category->id;
    }

    public function getCats()
    {
        return $arr = [
            'Строительство / ремонт / уборка' => [
                'Cтроительные услуги',
                'Дизайн / архитектур',
                'Отделка / ремонт',
                'Окна / двери / балкон',
                'Сантехника / коммуникаци',
                'Бытовой ремонт / уборка',
                'Вентиляция / кондиционировани',
                'Электрик',
                'Готовые конструкци',
            ],
            'Перевозки / аренда транспорта' => [

            ],
            'Сырьё / материалы' => [

            ],
            'Красота / здоровье' => [
                'Стрижки / наращивание волос',
                'Маникюр / наращивание ногтей',
                'Макияж / косметология / наращивание ресниц',
                'Медицина',
                'Массаж',
                'Красота / здоровье - прочее',
                'Услуги психолога',
            ],
            'Оборудование' => [

            ],
            'Развлечения / Искусство / Фото / Видео' => [

            ],
            'Ремонт и обслуживание техники' => [
                'Телефоны и смартфоны',
                'Компьютеры',
                'Бытовая техника',
                'Фото и видеоаппаратура',
                'Тв и видеотехника',
                'Аудиотехника',
                'Прочая техника',
                'Климатическая техника',
                'Игровые приставки',
            ],
            'Прочие услуги' => [

            ],


            'Финансовые услуги / партнерство' => [

            ],
            'Реклама / полиграфия / маркетинг / интернет' => [

            ],
            'Няни / сиделки' => [

            ],
            'Образование / Спорт' => [

            ],
            'Услуги для животных' => [

            ],
            'Продажа бизнеса' => [

            ],
            'Туризм / иммиграция' => [

            ],
            'Услуги переводчиков / набор текста' => [

            ],
            'Авто / мото услуги' => [

            ],
            'Сетевой маркетинг' => [

            ],
            'Юридические услуги' => [

            ],
            'Прокат товаров' => [

            ],
        ];
    }

    public function transliterate($string)
    {
        $str = mb_strtolower($string, 'UTF-8');

        $leter_array = array(
            'a' => 'а',
            'b' => 'б',
            'v' => 'в',
            'g' => 'г,ґ',
            'd' => 'д',
            'e' => 'е,э',
            'jo' => 'ё',
            'zh' => 'ж',
            'z' => 'з',
            'i' => 'и',
            'j' => 'й',
            'k' => 'к',
            'l' => 'л',
            'm' => 'м',
            'n' => 'н',
            'o' => 'о',
            'p' => 'п',
            'r' => 'р',
            's' => 'с',
            't' => 'т',
            'u' => 'у',
            'f' => 'ф',
            'kh' => 'х',
            'ts' => 'ц',
            'ch' => 'ч',
            'sh' => 'ш',
            'shch' => 'щ',
            'j' => 'ъ',
            'y' => 'ы',
            'j' => 'ь',
            'yu' => 'ю',
            'ya' => 'я',
        );

        foreach ($leter_array as $leter => $kyr) {
            $kyr = explode(',', $kyr);

            $str = str_replace($kyr, $leter, $str);
        }

        //  A-Za-z0-9-
        $str = preg_replace('/(\s|[^A-Za-z0-9\-_])+/', '-', $str);

        $str = trim($str, '-');

        return $str;
    }

}
