<?php

return array (
  'verify' => 'Підтвердження реєстрації.',
  'register' => 'Реєстрація.',
  'register_success' => 'Ваш акаунт успішно зареєстровано. На вказану поштову скриньку відправлено листа для
                            підтвердження..',
  'resent' => 'Якщо ви не отримали електронний лист',
  'resent_click' => 'натисніть тут, щоб отримати повторну активацію.',
  'resent_activation' => 'Отримати повторну активацію.',
  'resent_success' => 'новий код перевірки надісланий на вашу адресу електронної пошти',
  'email_confirmation' => 'Підтвердження реєстрації',
  'email_confirmation_click' => 'Для підтвердження перейдіть за посиланням',
  'email_confirmation_agree' => 'Реєстрацію підтверджую',
  'confirmation_complete' => 'Акаунт підтверджено',
);
